SetLoadUniformToFrame
Syntax
SapObject.SapModel.AreaObj.SetLoadUniformToFrame
VB6 Procedure
Function SetLoadUniformToFrame(ByVal Name As String, ByVal LoadPat As String, ByVal Value As Double, ByVal Dir As Long, ByVal DistType As Long, Optional ByVal Replace As Boolean = True, Optional ByVal CSys As String = "Global", Optional ByVal ItemType As eItemType = Object) As Long
Parameters
Name
The name of an existing area object or group depending on the value of the ItemType item.
LoadPat
The name of a defined load pattern.
Value
The uniform load value. [F/L2]
Dir
This is an integer between 1 and 11, indicating the direction of the load.
1 = Local 1 axis (only applies when CSys is Local)
2 = Local 2 axis (only applies when CSys is Local)
3 = Local 3 axis (only applies when CSys is Local)
4 = X direction (does not apply when CSys is Local)
5 = Y direction (does not apply when CSys is Local)
6 = Z direction (does not apply when CSys is Local)
7 = Projected X direction (does not apply when CSys is Local)
8 = Projected Y direction (does not apply when CSys is Local)
9 = Projected Z direction (does not apply when CSys is Local)
10 = Gravity direction (only applies when CSys is Global)
11 = Projected Gravity direction (only applies when CSys is Global)
The positive gravity direction (see Dir = 10 and 11) is in the negative Global Z direction.
DistType
This is either 1 or 2, indicating the load distribution type.
1 = One-way load distribution
2 = Two-way load distribution
One-way distribution is parallel to the area object local 1 axis. Two-way distribution is parallel to the area object local 1 and 2 axes.
Replace
If this item is True, all previous uniform loads, if any, assigned to the specified area object(s), in the specified load pattern, are deleted before making the new assignment.
CSys
This is Local or the name of a defined coordinate system, indicating the coordinate system in which the uniform load is specified.
ItemType
This is one of the following items in the eItemType enumeration:
Object = 0
Group = 1
SelectedObjects = 2
If this item is Object, the assignment is made to the area object specified by the Name item.
If this item is Group, the assignment is made to all area objects in the group specified by the Name item.
If this item is SelectedObjects, assignment is made to all selected area objects and the Name item is ignored.
Remarks
This function assigns uniform to frame loads to area objects.
The function returns zero if the loads are successfully assigned; otherwise it returns a nonzero value.
VBA Example
Sub AssignAreaObjectUniformToFrameLoad()
 'dimension variables
 Dim SapObject as cOAPI
 Dim SapModel As cSapModel
 Dim ret As Long
 'create Sap2000 object
 Set SapObject = CreateObject("CSI.SAP2000.API.SapObject")
 'start Sap2000 application
 SapObject.ApplicationStart
 'create SapModel object
 Set SapModel = SapObject.SapModel
 'initialize model
 ret = SapModel.InitializeNewModel
 'create model from template
 ret = SapModel.File.New3DFrame(BeamSlab, 2, 144, 3, 288, 2, 288)
 'assign area object uniform to frame loads
 ret = SapModel.AreaObj.SetLoadUniformToFrame("ALL", "DEAD", 0.01, 10, 2, False, "Global", Group)
 'close Sap2000
 SapObject.ApplicationExit False
 Set SapModel = Nothing
 Set SapObject = Nothing
 End Sub
Release Notes
Initial release in version 11.00.
Changed nomenclature from Load Cases, Analysis Cases and Response Combinations to Load Patterns, Load Cases and Load Combinations, respectively, in version 12.00.
See Also
GetLoadUniformToFrame
DeleteLoadUniformToFrame